// (C) 2013-2015, Sergei Zaychenko, KNURE, Kharkiv, Ukraine

// Страж включения
#ifndef _INTEGER_SEQUENCE_HPP_
#define _INTEGER_SEQUENCE_HPP_

/*****************************************************************************/


// Класс для последовательности
class IntegerSequence
{

/*-----------------------------------------------------------------*/

public:

/*-----------------------------------------------------------------*/

	// Конструктор
	IntegerSequence ( int nAllocated = 10 );

	// Деструктор
	~ IntegerSequence ();

	// Функция-член добавления значения в конец последовательности
	void PushBack ( int value );

	// Функция-член ввода последовательности
	void ReadTillZero ();

	// Функция-член подсчета суммы последовательности чисел
	int Accumulate () const;

/*-----------------------------------------------------------------*/

private:

/*-----------------------------------------------------------------*/

	// Внутренняя функция роста последовательности
	void Grow ();

/*-----------------------------------------------------------------*/

	int * m_pData;
	int m_nAllocated;
	int m_nUsed;

/*-----------------------------------------------------------------*/

};


/*****************************************************************************/

#endif // _INTEGER_SEQUENCE_HPP_

