// (C) 2013-2015, Sergei Zaychenko, KNURE, Kharkiv, Ukraine

#ifndef _PRINTER_HPP_
#define _PRINTER_HPP_

/*****************************************************************************/


class Printer
{

/*-----------------------------------------------------------------*/

	// Статическая переменная-чден, хранит указатель на созданный объект-одиночку
	static Printer * ms_Instance;

/*-----------------------------------------------------------------*/

	// Закрытый конструктор по умолчанию
	Printer ();

	// Закрытый деструктор
	~Printer ();

/*-----------------------------------------------------------------*/

public:

	// Статический метод доступа к объекту-одиночке
	static Printer * GetInstance ();

	// Удаленные конструктор копий и оператор присвоения (реализации не будет)
	Printer ( const Printer & ) = delete;
	Printer& operator = ( const Printer & ) = delete;

	// Обычный полезный метод
	void Print ( const char * _filePath );

/*-----------------------------------------------------------------*/

};

/*****************************************************************************/


#endif // _PRINTER_HPP_
